# Reference Properties

---
The SpecTypeIdReference type exposes the following members.
| Name| Description
---|---|---
| FillPattern|  Fill Pattern, in discipline Common.
| Image|  Image, in discipline Common.
| LoadClassification|  Load Classification, in discipline Electrical.
| Material|  Material, in discipline Common.
Top
#### Reference
SpecTypeIdReference Class
Autodesk.Revit.DB Namespace